Delete from public."Data";
Delete from public."ApprovedForms";
Delete from public."ApprovedFormItems";
Delete from public."ApprovedFormItemColumns";

INSERT INTO public."ApprovedForms"( "Id","Description", "ApprovalDate", "IsDel") VALUES ('d388f634-d783-43ab-b57a-90062e6f2e26','Тестовая форма', '2024-01-01', false);
INSERT INTO public."ApprovedFormItems"("Id", "ApprovedFormId", "ServiceId", "Title", "DisplayOrder", "IsDel","IsVillage") 
VALUES 
('eb654fe1-a9d6-4598-953b-b9ff5a71c280', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 1', 1, false, false),
('3cef86bf-800e-4564-a494-e1f1e388d35c', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 2', 2, false, false),
('b76b2baf-d053-42b4-9e9a-36268364e37e', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 3', 3, false, false),
('7eb4c1c3-fc2f-4c60-a384-b2adaede4e95', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 4', 4, false, false),
('122a1da2-ce80-4c6f-b2ba-46743e1dd59c', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 5', 5, false, false),
--село
('bab3f1ec-47b5-4476-b29e-273997b918ad', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 1', 6, false, true),
('2a3bde11-a8cd-40f0-92ee-37ca15f32455', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 2', 7, false, true),
('06099464-6a37-4218-9b73-37862eee7fde', 'd388f634-d783-43ab-b57a-90062e6f2e26', 0, 'Форма 3', 8, false, true),
--водоотведение
('3746b85b-be6b-488f-bfe7-94367482d726', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 1', 9, false, false),
('b00c5049-9ce8-4a7d-a495-8962874602ef', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 2', 10, false, false),
('bbd07b4b-df67-4fba-9209-77f3663e7156', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 3', 11, false, false),
-- село
('ec78e024-9207-42d1-887b-57da17591d2d', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 1', 12, false, true),
('9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 2', 13, false, true),
('fd9587f2-8ddf-4e0b-b5c4-638d567d90f4', 'd388f634-d783-43ab-b57a-90062e6f2e26', 1, 'Форма 3', 14, false, true);



INSERT INTO public."ApprovedFormItemColumns"("Id", "ApprovedFormItemId", "DataType", "NameRu","NameKk", "Nullable", "DisplayOrder", "Length")
VALUES 
--водоснабжение форма 1
('fa4c493c-6ea9-4c18-9558-bf53d0990b79', 'eb654fe1-a9d6-4598-953b-b9ff5a71c280', 2, 'Количество снабжаемой воды','', false, 1, 0),
--водоснабжение форма 2
('f4f8c859-258c-4af5-be07-ceb835795cfa', '3cef86bf-800e-4564-a494-e1f1e388d35c', 4, 'Охваченные централизованным водоснабжением (0-1)','', false, 1, 0),
('12ab9b57-6422-463c-a755-01bcee5f880e', '3cef86bf-800e-4564-a494-e1f1e388d35c', 1, 'Количество населения имеющих доступ к  централизованному водоснабжению (человек)','', false, 2, 0),
--водоснабжение форма 3
('5b3550d1-848e-43b5-b334-a5c7f1b2c298', 'b76b2baf-d053-42b4-9e9a-36268364e37e', 1, 'всего с нарастающим (единиц)','', false, 1, 0),
('24d1c8a1-6388-4bcd-a703-aec544c0b3c5', 'b76b2baf-d053-42b4-9e9a-36268364e37e', 1, 'в том числе с дистанционной передачей данных в АСУЭ обслуживающего предприятия (единиц)','', false, 2, 0),
--водоснабжение форма 4
('7c4b1b6d-fde0-4b0e-b8de-e3bc77d61e0b', '7eb4c1c3-fc2f-4c60-a384-b2adaede4e95', 1, 'Количество зданий и сооружений, подлежащих к установке общедомовых приборов учета (единиц)','', false, 1, 0),
('bf708cb0-4661-4c2a-8735-338059c6f7f3', '7eb4c1c3-fc2f-4c60-a384-b2adaede4e95', 1, 'Количество зданий и сооружений с установленными общедомовыми приборами учета (единиц)','', false, 2, 0),
('1b347b81-e581-4b41-9404-d230c567dfe7', '7eb4c1c3-fc2f-4c60-a384-b2adaede4e95', 1, 'Количество установленных общедомовых приборов учета (единиц)','', false, 3, 0),
('b2d5a3e7-c7c9-48dc-b12d-31f3e2520f2c', '7eb4c1c3-fc2f-4c60-a384-b2adaede4e95', 1, 'в том числе с дистанционной передачей данных в АСУЭ обслуживающего предприятия (единиц)','', false, 4, 0),
--водоснабжение форма 5
('0f25ebce-1f0a-49da-99bf-4e07a6584b51', '122a1da2-ce80-4c6f-b2ba-46743e1dd59c', 4, 'Водозабор (0 или 1)','', false, 1, 0),
('37169d6a-832f-4005-a0c8-9c6096ed5eb7', '122a1da2-ce80-4c6f-b2ba-46743e1dd59c', 4, 'Водоподготовка (0 или 1)','', false, 2,0),
('fd5c89a1-4e4a-4358-93e1-6ef7d70bacbc', '122a1da2-ce80-4c6f-b2ba-46743e1dd59c', 4, 'Насосные станции (0 или 1)','', false, 3, 0),
('23d92dc0-eed1-4ebe-b26e-6d5f1e2ff9ac', '122a1da2-ce80-4c6f-b2ba-46743e1dd59c', 4, 'Сети водоснабжения (0 или 1)','', false, 4,0),
--водоснабжение форма 1 село
('cc1eb716-8b9f-4f04-8cb2-fb04bfe98787', 'bab3f1ec-47b5-4476-b29e-273997b918ad', 2, 'Количество снабжаемой воды','', false, 1,0),
--водоснабжение форма 2 село
('9f09ca74-ce16-4cbc-9400-1afd44f77c74', '2a3bde11-a8cd-40f0-92ee-37ca15f32455', 1, 'Численность населения, проживающего в данных сельских населенных пунктах (человек)','', false, 1,0),
('9c78191d-cc63-4c4c-b262-d00526fdae90', '2a3bde11-a8cd-40f0-92ee-37ca15f32455', 1, 'Кол-во абонентов, охваченных централизованным водоснабжением (единиц)','', false, 2,0),
('c0788163-cb6e-4f91-a9ee-e8aab69f16b1', '2a3bde11-a8cd-40f0-92ee-37ca15f32455', 1, 'Всего установлено индивидуальных приборов учета воды по состоянию на конец отчетного года (единиц)','', false, 3,0),
('65cb4d4f-0b08-4e0d-8aa6-6c5122af6dce', '2a3bde11-a8cd-40f0-92ee-37ca15f32455', 1, 'в том числе с дистанционной передачей данных в АСУЭ обслуживающего предприятия (единиц)','', false, 4,0),
--водоснабжение форма 3 село
('3a2043a5-5fea-453f-a1ee-b35ccba2c9cc', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Количество сельских населенных пунктов (единиц)','', false, 1,0),
('5ddbe812-920e-49de-8657-7f528ba6c7d9', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Численность населения, проживающего в сельских населенных пунктах, где установлены КБМ (человек)','', false, 1,0),
('e571aae6-88d9-4bdd-85ba-5ccdf18912ee', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Численность населения, проживающего в сельских населенных пунктах, где установлены ПРВ (человек)','', false, 2,0),
('dbea2ad1-7fbc-4610-acbe-72206d669fa4', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Численность населения, проживающего в сельских населенных пунктах, где используют привозную воду','', false, 3,0),
('2bb1a54f-88e8-4e80-a121-91fc63625e1d', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Численность населения, проживающего в сельских населенных пунктах, где используют воду из скважин и колодцев','', false, 4,0),
('0f879401-bdb3-43c5-adc6-88ae89ae1f16', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Количество сельских населенных пунктов, жители которых отказались от строительства ЦВ, установки КБМ и ПРВ (наличие протоколов отказа)','', false, 5,0),
('c57a4586-9599-4102-ab45-da32a890319d', '06099464-6a37-4218-9b73-37862eee7fde', 1, 'Численность населения, жители которых отказались от строительства ЦВ, установки КБМ и ПРВ (наличие протоколов отказа)','', false, 6,0),

--водоотведение
--форма 1
('1e69a416-233d-4028-bf11-9b934e09fc5e', '3746b85b-be6b-488f-bfe7-94367482d726', 2, 'Объем воды (тыс. м3)','', false, 1,0),
--форма 2
('914bd80b-d730-476a-8615-70f1d1204b88', 'b00c5049-9ce8-4a7d-a495-8962874602ef', 4, 'Охваченные централизованным водоотведением (0-1)','', false, 1,0),
('59068dbc-2410-4435-9135-7b762f817add', 'b00c5049-9ce8-4a7d-a495-8962874602ef', 4, 'Наличие канализационно-очистных сооружений, (1-0)','', false, 2,0),
('2ed62cbc-4bc8-43df-922a-95d8fabe5c97', 'b00c5049-9ce8-4a7d-a495-8962874602ef', 4, 'С механичес-кой очисткой (1-0)','', false, 3,0),
('34209878-79dd-4656-8366-a2bed1598c4d', 'b00c5049-9ce8-4a7d-a495-8962874602ef', 4, 'С механической и биологической очист-кой (1-0)','', false, 4,0),
('671a07ee-03a1-4544-9325-d42cbef3c7e1', 'b00c5049-9ce8-4a7d-a495-8962874602ef', 1, 'Численность населения, охваченного централизованным водоотведением, (человек)','', false, 5,0),
--форма  3
('29cc726a-9dd1-44b6-89a7-1a2c01dfabb8', 'bbd07b4b-df67-4fba-9209-77f3663e7156', 4, 'Сети канализации (0 или 1)','', false, 1,0),
('01c2d3ba-8b23-4f51-a7a9-b46c28a48ba8', 'bbd07b4b-df67-4fba-9209-77f3663e7156', 4, 'Канализационные насосные станции (0 или 1)','', false, 2,0),
('5322a7c7-06fa-4535-bc3d-1bd97f6f4f85', 'bbd07b4b-df67-4fba-9209-77f3663e7156', 4, 'Канализационно-очистные сооружения (0 или 1)','', false, 3,0),
--форма 1 село
('ba94d447-24d0-4e0b-8645-b3394341bb7f', 'ec78e024-9207-42d1-887b-57da17591d2d', 2, 'Фактически поступило сточных вод в канализационно-очистные сооружения (ОТЧЕТ)','', false, 1,0),
--форма 2 село
('e09248b0-1c15-4b69-b288-637c9c2dff8d', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Кол-во сельских населенных пунктов (единиц)','', false, 1,0),
('f30b76a8-9b9c-4e31-822c-9d0e0108f175', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Численность населения, проживающего в данных сельских населенных пунктах (человек)','', false, 2,0),
('683202d3-18df-4ddf-bd76-fb0b447abe62', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Кол-во абонентов, проживающих в данных сельских населенных пунктах (единиц)','', false, 3,0),
('10048d68-0f5d-48f7-8b3f-c655477698fa', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'физических лиц/население (единиц)','', false, 4,0),
('7352672b-087c-4ad5-b644-d6ef374dac73', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'юридических лиц (единиц)','', false, 5,0),
('16219872-4b0e-4707-957c-91f8c8422d36', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'бюджетных организаций (единиц)','', false, 6,0),
('3399f680-6d82-4450-8d10-d106a5c2149e', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Наличие канализационно- очистных сооружений (единиц)','', false, 7,0),
('8cec3596-66f5-4c25-baaf-08e367d3611e', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'только с механичес-кой очисткой (еди-ниц)','', false, 8,0),
('6b22da7f-4964-49e4-9016-6ab569e3b62e', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'с механической и биологической очист-кой (еди-ниц)','', false, 9,0),
('3d655ed0-03d2-421f-827d-b2fd78c1bc19', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Производительность канализационно-очистных сооружений (проектная)','', false, 10,0),
('755d1418-5f42-40da-923c-f47595354ed2', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 2, 'Износ канализационно- очистных сооружений, в %','', false, 11,0),
('a1bd11d2-d9d0-41c7-9c14-e036d3432f2a', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 1, 'Числен-ность населе-ния, охваченного действующими канализационно- очистными сооружениями (человек)','', false, 12,0),
('7a1c3d23-1f8d-4370-96f4-470fd21cc1c9', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 2, 'Фактически поступило сточных вод в канализационно-очистные сооружения (тыс.м3)','', false, 13,0),
('257eaad8-794e-4626-87b3-9afa0a78115e', '9edd34d9-f742-4c8e-8816-6ee1ebe4301f', 2, 'Объем сточных вод, соответствующей нормативной очистке по собственному лабораторному мониторингу за отчетный период (тыс.м3)','', false, 14,0);



